tutorials/RAS/Dohmen-Janssen2002/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    		(-75.78     -0.001 -3.5) // 0
		(-4.4    -0.001 -3.5) // 1
		(-2.0    -0.001 -3.5) // 2
		(-2.0    -0.001 -3.6) // 3
		(-2.0    -0.001 -3.4) // 4
		(-2.0    -0.001 -1.0) // 5
		(-2.0    -0.001  3.0) // 6
		(-4.4    -0.001  3.0) // 7
		(-75.78     -0.001  3.0) // 8
		(-75.78     -0.001 -1.0) // 9
		(-75.78     -0.001 -3.4) // 10
		(-4.4    -0.001 -3.4) // 11
		(-4.4    -0.001 -1.0) // 12
		
		(75.78     -0.001 -3.5) // 13
		(4.4    -0.001 -3.5) // 14
		(2.0    -0.001 -3.5) // 15
		(2.0    -0.001 -3.6) // 16
		(2.0    -0.001 -3.4) // 17
		(2.0    -0.001 -1.0) // 18
		(2.0    -0.001  3.0) // 19
		(4.4    -0.001  3.0) // 20
		(75.78     -0.001  3.0) // 21
		(75.78     -0.001 -1.0) // 22
		(75.78     -0.001 -3.4) // 23
		(4.4    -0.001 -3.4) // 24
		(4.4    -0.001 -1.0) // 25

		(-75.78     0.001 -3.5) // 26
   		(-4.4    0.001 -3.5) // 27
		(-2.0    0.001 -3.5) // 28
		(-2.0    0.001 -3.6) // 29
		(-2.0    0.001 -3.4) // 30
		(-2.0    0.001 -1.0) // 31
		(-2.0    0.001  3.0) // 32
		(-4.4    0.001  3.0) // 33
		(-75.78     0.001  3.0) // 34
		(-75.78     0.001 -1.0) // 35
		(-75.78     0.001 -3.4) // 36
		(-4.4    0.001 -3.4) // 37
		(-4.4    0.001 -1.0) // 38
		
		(75.78     0.001 -3.5) // 39
		(4.4    0.001 -3.5) // 40
		(2.0    0.001 -3.5) // 41
		(2.0    0.001 -3.6) // 42
		(2.0    0.001 -3.4) // 43
		(2.0    0.001 -1.0) // 44
		(2.0    0.001  3.0) // 45
		(4.4    0.001  3.0) // 46
		(75.78     0.001  3.0) // 47
		(75.78     0.001 -1.0) // 48
		(75.78     0.001 -3.4) // 49
		(4.4    0.001 -3.4) // 50
		(4.4    0.001 -1.0) // 51
);

blocks          
(
    hex (9 12 38 35 8 7 33 34) (1493 1 252) simpleGrading (1 1 1)
    hex (10 11 37 36 9 12 38 35) (1493 1 151) simpleGrading (1 1 1)
    hex (0 1 27 26 10 11 37 36) (1493 1 6) simpleGrading (1 1 1)
    
    hex (12 5 31 38 7 6 32 33) (50 1 252) simpleGrading (1 1 1)
    hex (11 4 30 37 12 5 31 38) (50 1 151) simpleGrading (1 1 1)
    hex (1 2 28 27 11 4 30 37) (50 1 6) simpleGrading (1 1 1)
    
    hex (5 18 44 31 6 19 45 32) (84 1 252) simpleGrading (1 1 1)
    hex (4 17 43 30 5 18 44 31) (84 1 151) simpleGrading (1 1 1)
    hex (2 15 41 28 4 17 43 30) (84 1 6) simpleGrading (1 1 1)
    hex (3 16 42 29 2 15 41 28) (84 1 6) simpleGrading (1 1 1)
    
    hex (18 25 51 44 19 20 46 45) (50 1 252) simpleGrading (1 1 1)
    hex (17 24 50 43 18 25 51 44) (50 1 151) simpleGrading (1 1 1)
    hex (15 14 40 41 17 24 50 43) (50 1 6) simpleGrading (1 1 1)
 
    hex (25 22 48 51 20 21 47 46) (1493 1 252) simpleGrading (1 1 1)
    hex (24 23 49 50 25 22 48 51) (1493 1 151) simpleGrading (1 1 1)
    hex (14 13 39 40 24 23 49 50) (1493 1 6) simpleGrading (1 1 1)
);

edges           
(
);

boundary         
(
    inlet 
    {
	  type patch;
	  faces
    (
	(0 10 36 26)
	(10 9 35 36)
	(9 8 34 35)
    );
    }
    bottom 
    {
	  type wall;
	  faces
    (
        (0 26 27 1)
        (1 27 28 2)
        (2 28 29 3)
        (3 29 42 16)
        (16 42 41 15)
        (15 41 40 14)	
        (14 40 39 13)
        (13 39 49 23)
        (23 49 48 22)
        (22 48 47 21)
    );
    }
    atmosphere
    {
	  type patch;
	  faces
    (
        (8 7 33 34)
        (7 6 32 33)
        (6 19 45 32)
        (19 20 46 45)
        (20 21 47 46)    
    );
    }

    frontandback2
    {
    type emptyy;
    	  faces
    (
        (0 1 11 10)
        (10 11 12 9)
        (9 12 7 8)
        (1 2 4 11)
        (11 4 5 12)
        (12 5 6 7)
        (3 16 15 2)
        (2 15 17 4)
        (4 17 18 5)
        (5 18 19 6)
        (15 14 24 17)
        (17 24 25 18)
        (18 25 20 19)
        (14 13 23 24)
        (24 23 22 25)
        (25 22 21 20)
    );
    }


	 frontandback1
    {
    type emptyy;
          faces
    (


        (26 36 37 27)
        (36 35 38 37)
        (35 34 33 38)
        (27 37 30 28)
        (37 38 31 30)
        (38 33 32 31)
        (29 28 41 42)
        (28 30 43 41)
        (30 31 44 43)
        (31 32 45 44)
        (41 43 50 40)
        (43 44 51 50)
        (44 45 46 51)
        (40 50 49 39)
        (50 51 48 49)
        (51 46 47 48)		
    );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
