tutorials/RAS/Dohmen-Janssen2002/constant/granularRheologyProperties
/*
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      granaularRheologyProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

granularRheology   off;

granularDilatancy  off;

alphasMaxG       alphasMaxG [ 0 0 0 0 0 0 0 ] 0.625;

muss            muss  [ 0 0 0 0 0 0 0 ] 0.63;

mu2             mu2  [ 0 0 0 0 0 0 0 ] 1.13;

I0              I0  [ 0 0 0 0 0 0 0 ] 0.6;

Bphi            Bphi [ 0 0 0 0 0 0 0 ] 0.66;

n               n [ 0 0 0 0 0 0 0 ] 2.5;

Dsmall          Dsmall [ 0 0 -1 0 0 0 0 ] 1e-4;

relaxPs         relaxPs [ 0 0 0 0 0 0 0 ] 5e-5;

//FrictionModel  Coulomb;
FrictionModel  MuIv;

//PPressureModel  none;
PPressureModel MuIv;

//FluidViscosityModel  Einstein;
FluidViscosityModel BoyerEtAl;

// ************************************************************************* //
