tutorials/RAS/Dohmen-Janssen2002/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          GAMG;
        tolerance       1e-10;
        relTol          0;
        smoother        DIC;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-10;
        relTol          0;
    }
    
    gamma 
    {
        nLimiterIter    3;
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-15;
        relTol          0;
    }
    gammaFinal
    {
        $gamma;
        tolerance       1e-15;
        relTol          0;
    }

    "(alpha.*|gamma|Theta|ps_new_value|alphasPlastic)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-20;
        relTol          0;
    }
    "(alpha.*Final|gammaFinal|ThetaFinal|psFinal|alphasPlasticFinal)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-20;
        relTol          0;
    }

    Theta
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-10;
        relTol          0;
        nSweeps         1;
    }
    ThetaFinal
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-15;
        relTol          0;
        nSweeps         1;
        maxIter	100;
    }

    "(k.flu|epsilon.flu)"
    {
	solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-11;
        relTol          0;
        minIter         2;
    }

    "(k.fluFinal|epsilon.fluFinal)"
    {
       solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-11;
        relTol          0;
        minIter         2;
    }
}

PIMPLE
{
    momentumPredictor 0;
    nOuterCorrectors  1;
    nCorrectors     5;
    nNonOrthogonalCorrectors 0;
    correctAlpha    1;
    nAlphasCorr     1;
    nGammaCorr     1;
    nAlphaSubCycles 1;
    pRefCell        0;
    pRefValue       0;
    MULESCorr       yes;
    nLimiterIter    3;
    cAlpha         1;
}

// ************************************************************************* //
