tutorials/RAS/Dohmen-Janssen2002/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      funkySetFieldDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
(
  alpha.sol
  {
    field alpha.sol;
    keepPatches true;
    expression "0.5*0.61*(1+tanh(-840-240*pos().z))";
    condition  "(pos().x<2) && (pos().x>=-2)";
  }
);

// ************************************************************************* //
